Soap/Insure_register/policy_request.xml

<?xml version="1.0" encoding="utf-8"?> 
                        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
                        xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"> 
                        <soap:Body> <GetTravelPolicy xmlns="http://ACE.Global.Travel.CRS.Schemas.ACORD.WS/"> 
                        <ACORD xmlns="http://ACE.Global.Travel.CRS.Schemas.ACORD_PolicyReq"><SignonRq><SignonPswd><CustId><SPName>com.evolableasia</SPName><CustLoginId>evolableasiaflight_jp.svc</CustLoginId></CustId><CustPswd><EncryptionTypeCd>None</EncryptionTypeCd><Pswd>$craMBLeD@123!</Pswd></CustPswd></SignonPswd><ClientDt>2018-07-31T15:06:19</ClientDt><CustLangPref>JA</CustLangPref><ClientApp><Org>com.evolableasia</Org><Name>evolableasia Flight</Name><Version>1.0</Version></ClientApp></SignonRq><InsuranceSvcRq><PersPkgPolicyAddRq><TransactionRequestDt>2018-07-31T15:06:19</TransactionRequestDt><InsuredOrPrincipal><GeneralPartyInfo><NameInfo id="0"><PersonName><Surname></Surname><GivenName></GivenName><TitlePrefix>Mr</TitlePrefix></PersonName><BirthDt></BirthDt><Gender>M</Gender><TitleRelationshipDesc>Policy Holder</TitleRelationshipDesc></NameInfo><NameInfo id="1"><PersonName><Surname></Surname><GivenName></GivenName><TitlePrefix>Mr</TitlePrefix></PersonName><BirthDt></BirthDt><Gender>M</Gender></NameInfo><Communications><PhoneInfo><PhoneTypeCd>Telephone</PhoneTypeCd><PhoneNumber>0902202006</PhoneNumber></PhoneInfo><EmailInfo><EmailAddr>duyennt@evolableasia.vn</EmailAddr></EmailInfo></Communications></GeneralPartyInfo></InsuredOrPrincipal><PersPolicy><CompanyProductCd>C7363B08-0761-4A16-8804-A02B001A8DA1</CompanyProductCd><ContractTerm><EffectiveDt>2018-08-09</EffectiveDt><ExpirationDt>2018-08-12</ExpirationDt></ContractTerm><com.acegroup_Destination><RqUID>833B107A-9DC7-4D52-841D-6074884DCF50</RqUID><DestinationDesc>Domestic</DestinationDesc></com.acegroup_Destination><com.acegroup_InsuredPackage><RqUID>851CFFF2-ED6E-4835-A7FD-9D0D0019C474</RqUID><InsuredPackageDesc>Individual</InsuredPackageDesc></com.acegroup_InsuredPackage><com.acegroup_Plan><RqUID>531CC7DB-2D16-4A2B-A59A-5E357AD22797</RqUID><PlanDesc>CD1</PlanDesc></com.acegroup_Plan></PersPolicy><com.acegroup_DataExtensions><DataItem key="Total_Insured" type="System.Integer"><value>2</value></DataItem><DataItem key="Purpose" type="System.String"><value>2</value></DataItem></com.acegroup_DataExtensions></PersPkgPolicyAddRq></InsuranceSvcRq>
                        </ACORD>
                        </GetTravelPolicy>
                        </soap:Body>
                        </soap:Envelope>